OpenFOAM-13/tutorials/incompressibleVoF/nozzleFlow2D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinates
{
    type        global;

    e1          (1 0 0);
    e2          (0 1 0);

    directions  (e1);
}

zones
{
    level1
    {
        type    box;
        box     (0 0 -2e-05) (0.0036 0.0008 4e-05);
    }

    level2
    {
        type    box;
        box     (0 0 -2e-05) (0.0036 0.0003 2e-05);
    }
}

// ************************************************************************* //
